yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/ioastwbc5v.h
/* Status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UIF         : 1;
} __BITS_STMR_SR1;
#endif
__IO_REG8_BIT(STMR_SR1,    0x5342, __READ_WRITE, __BITS_STMR_SR1);

/* Event generation register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UG          : 1;
} __BITS_STMR_EGR;
#endif
__IO_REG8_BIT(STMR_EGR,    0x5343, __WRITE, __BITS_STMR_EGR);

/* Counter high register */
__IO_REG8    (STMR_CNTH,   0x5344, __READ_WRITE);
/* Counter low register */
__IO_REG8    (STMR_CNTL,   0x5345, __READ_WRITE);
/* Prescaler register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PSC         : 3;
} __BITS_STMR_PSCL;
#endif
__IO_REG8_BIT(STMR_PSCL,   0x5346, __READ_WRITE, __BITS_STMR_PSCL);

/* Auto-reload high register */
__IO_REG8    (STMR_ARRH,   0x5347, __READ_WRITE);
/* Auto-reload low register */
__IO_REG8    (STMR_ARRL,   0x5348, __READ_WRITE);

/*-------------------------------------------------------------------------
 *      STMR Registers bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define STMR_CR1_CEN             STMR_CR1_bit.CEN
#define STMR_CR1_UDIS            STMR_CR1_bit.UDIS
#define STMR_CR1_URS             STMR_CR1_bit.URS
#define STMR_CR1_OPM             STMR_CR1_bit.OPM
#define STMR_CR1_ARPE            STMR_CR1_bit.ARPE

#define STMR_IER_UIE             STMR_IER_bit.UIE

#define STMR_SR1_UIF             STMR_SR1_bit.UIF

#define STMR_EGR_UG              STMR_EGR_bit.UG

#define STMR_PSCL_PSC            STMR_PSCL_bit.PSC

#endif

/*-------------------------------------------------------------------------
 *      STMR Registers bit masks
 *-----------------------------------------------------------------------*/
#define MASK_STMR_CR1_CEN        0x01
#define MASK_STMR_CR1_UDIS       0x02
#define MASK_STMR_CR1_URS        0x04
#define MASK_STMR_CR1_OPM        0x08
#define MASK_STMR_CR1_ARPE       0x80

#define MASK_STMR_IER_UIE        0x01

#define MASK_STMR_SR1_UIF        0x01

#define MASK_STMR_EGR_UG         0x01

#define MASK_STMR_PSCL_PSC       0x07


/*-------------------------------------------------------------------------
 *      ADC Registers register definitions
 *-----------------------------------------------------------------------*/
/* Configuration register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PD          : 1;
  unsigned char STOP        : 1;
  unsigned char FIFO_FLUSH  : 1;
  unsigned char CIRCULAR    : 1;
  unsigned char FORMAT      : 1;
} __BITS_ADC_CFG;
#endif
__IO_REG8_BIT(ADC_CFG,     0x5400, __READ_WRITE, __BITS_ADC_CFG);

/* Start Of Conversion */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SOC         : 1;
} __BITS_ADC_SOC;
#endif
__IO_REG8_BIT(ADC_SOC,     0x5401, __WRITE, __BITS_ADC_SOC);

/* Interrupt Enable Register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char EOC_EN      : 1;
  unsigned char EOS_EN      : 1;
  unsigned char SEQ_FULL_EN : 1;
} __BITS_ADC_IER;
#endif
__IO_REG8_BIT(ADC_IER,     0x5402, __READ_WRITE, __BITS_ADC_IER);

/* Sequencer Register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CH          : 3;
  unsigned char GAIN        : 1;
} __BITS_ADC_SEQ;
#endif
__IO_REG8_BIT(ADC_SEQ,     0x5403, __WRITE, __BITS_ADC_SEQ);

/* Data Low Register */
__IO_REG8    (ADC_DATL_0,  0x5404, __READ);
/* Data High Register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DATA_HIGH   : 2;
} __BITS_ADC_DATH_0;
#endif
__IO_REG8_BIT(ADC_DATH_0,  0x5405, __READ, __BITS_ADC_DATH_0);

/* Data Low Register */
__IO_REG8    (ADC_DATL_1,  0x5406, __READ);
/* Data High Register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DATA_HIGH   : 2;
} __BITS_ADC_DATH_1;
#endif
__IO_REG8_BIT(ADC_DATH_1,  0x5407, __READ, __BITS_ADC_DATH_1);

/* Data Low Register */
__IO_REG8    (ADC_DATL_2,  0x5408, __READ);
/* Data High Register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DATA_HIGH   : 2;
} __BITS_ADC_DATH_2;
#endif
__IO_REG8_BIT(ADC_DATH_2,  0x5409, __READ, __BITS_ADC_DATH_2);

/* Data Low Register */
__IO_REG8    (ADC_DATL_3,  0x540A, __READ);
/* Data High Register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DATA_HIGH   : 2;
} __BITS_ADC_DATH_3;
#endif
__IO_REG8_BIT(ADC_DATH_3,  0x540B, __READ, __BITS_ADC_DATH_3);

/* Data Low Register */
__IO_REG8    (ADC_DATL_4,  0x540C, __READ);
/* Data High Register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DATA_HIGH   : 2;
} __BITS_ADC_DATH_4;
#endif
__IO_REG8_BIT(ADC_DATH_4,  0x540D, __READ, __BITS_ADC_DATH_4);

/* Data Low Register */
__IO_REG8    (ADC_DATL_5,  0x540E, __READ);
/* Data High Register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DATA_HIGH   : 2;
} __BITS_ADC_DATH_5;
#endif
__IO_REG8_BIT(ADC_DATH_5,  0x540F, __READ, __BITS_ADC_DATH_5);

/* Data Low Register */
__IO_REG8    (ADC_DATL_6,  0x5410, __READ);
/* Data High Register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DATA_HIGH   : 2;
} __BITS_ADC_DATH_6;
#endif
__IO_REG8_BIT(ADC_DATH_6,  0x5411, __READ, __BITS_ADC_DATH_6);

/* Data Low Register */
__IO_REG8    (ADC_DATL_7,  0x5412, __READ);
/* Data High Register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DATA_HIGH   : 2;
} __BITS_ADC_DATH_7;
#endif
__IO_REG8_BIT(ADC_DATH_7,  0x5413, __READ, __BITS_ADC_DATH_7);

/* Status Register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char EOC         : 1;
  unsigned char EOS         : 1;
  unsigned char SEQ_FULL    : 1;
} __BITS_ADC_SR;
#endif
__IO_REG8_BIT(ADC_SR,      0x5414, __READ_WRITE, __BITS_ADC_SR);

/* SOC Delay Counter Register */
__IO_REG8    (ADC_DLYCNT,  0x5415, __READ_WRITE);

/*-------------------------------------------------------------------------
 *      ADC Registers bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define ADC_CFG_PD               ADC_CFG_bit.PD
#define ADC_CFG_STOP             ADC_CFG_bit.STOP
#define ADC_CFG_FIFO_FLUSH       ADC_CFG_bit.FIFO_FLUSH
#define ADC_CFG_CIRCULAR         ADC_CFG_bit.CIRCULAR
#define ADC_CFG_FORMAT           ADC_CFG_bit.FORMAT

