yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/ioastwbc5v.h
/* Time T2 msb register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TIM_T2H0    : 1;
  unsigned char TIM_T2H1    : 1;
  unsigned char TIM_T2H2    : 1;
  unsigned char TIM_T2H3    : 1;
  unsigned char TIM_T2H4    : 1;
  unsigned char TIM_T2H5    : 1;
  unsigned char TIM_T2H6    : 1;
  unsigned char TIM_T2H7    : 1;
} __BITS_SMD0_TMR_T2H;
#endif
__IO_REG8_BIT(SMD0_TMR_T2H, 0x5509, __READ_WRITE, __BITS_SMD0_TMR_T2H);

/* Time T3 lsb register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TIM_T3L0    : 1;
  unsigned char TIM_T3L1    : 1;
  unsigned char TIM_T3L2    : 1;
  unsigned char TIM_T3L3    : 1;
  unsigned char TIM_T3L4    : 1;
  unsigned char TIM_T3L5    : 1;
  unsigned char TIM_T3L6    : 1;
  unsigned char TIM_T3L7    : 1;
} __BITS_SMD0_TMR_T3L;
#endif
__IO_REG8_BIT(SMD0_TMR_T3L, 0x550A, __READ_WRITE, __BITS_SMD0_TMR_T3L);

/* Time T3 msb register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TIM_T3H0    : 1;
  unsigned char TIM_T3H1    : 1;
  unsigned char TIM_T3H2    : 1;
  unsigned char TIM_T3H3    : 1;
  unsigned char TIM_T3H4    : 1;
  unsigned char TIM_T3H5    : 1;
  unsigned char TIM_T3H6    : 1;
  unsigned char TIM_T3H7    : 1;
} __BITS_SMD0_TMR_T3H;
#endif
__IO_REG8_BIT(SMD0_TMR_T3H, 0x550B, __READ_WRITE, __BITS_SMD0_TMR_T3H);

/* Parameter 0 IDLE register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char NX_STAT0    : 1;
  unsigned char NX_STAT1    : 1;
  unsigned char EDGE0       : 1;
  unsigned char EDGE1       : 1;
  unsigned char CNT_RSTE    : 1;
  unsigned char PULS_EDG    : 1;
  unsigned char HOLD_JMP    : 1;
  unsigned char AND_OR      : 1;
} __BITS_SMD0_PRM_ID0;
#endif
__IO_REG8_BIT(SMD0_PRM_ID0, 0x550C, __READ_WRITE, __BITS_SMD0_PRM_ID0);

/* Parameter 1 IDLE register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 2;
  unsigned char CEDGE0      : 1;
  unsigned char CEDGE1      : 1;
  unsigned char CNT_RSTC    : 1;
  unsigned char PULS_CMP    : 1;
  unsigned char HOLD_EXIT   : 1;
} __BITS_SMD0_PRM_ID1;
#endif
__IO_REG8_BIT(SMD0_PRM_ID1, 0x550D, __READ_WRITE, __BITS_SMD0_PRM_ID1);

/* Parameter 2 IDLE register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LATCH_RS    : 1;
} __BITS_SMD0_PRM_ID2;
#endif
__IO_REG8_BIT(SMD0_PRM_ID2, 0x550E, __READ_WRITE, __BITS_SMD0_PRM_ID2);

/* Parameter 0 S0 register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char NX_STAT0    : 1;
  unsigned char NX_STAT1    : 1;
  unsigned char EDGE0       : 1;
  unsigned char EDGE1       : 1;
  unsigned char CNT_RSTE    : 1;
  unsigned char PULS_EDG    : 1;
  unsigned char HOLD_JMP    : 1;
  unsigned char AND_OR      : 1;
} __BITS_SMD0_PRM_S00;
#endif
__IO_REG8_BIT(SMD0_PRM_S00, 0x550F, __READ_WRITE, __BITS_SMD0_PRM_S00);

/* Parameter 1 S0 register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 2;
  unsigned char CEDGE0      : 1;
  unsigned char CEDGE1      : 1;
  unsigned char CNT_RSTC    : 1;
  unsigned char PULS_CMP    : 1;
  unsigned char HOLD_EXIT   : 1;
} __BITS_SMD0_PRM_S01;
#endif
__IO_REG8_BIT(SMD0_PRM_S01, 0x5510, __READ_WRITE, __BITS_SMD0_PRM_S01);

/* Parameter 2 S0 register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LATCH_RS    : 1;
} __BITS_SMD0_PRM_S02;
#endif
__IO_REG8_BIT(SMD0_PRM_S02, 0x5511, __READ_WRITE, __BITS_SMD0_PRM_S02);

/* Parameter 0 S1 register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char NX_STAT0    : 1;
  unsigned char NX_STAT1    : 1;
  unsigned char EDGE0       : 1;
  unsigned char EDGE1       : 1;
  unsigned char CNT_RSTE    : 1;
  unsigned char PULS_EDG    : 1;
  unsigned char HOLD_JMP    : 1;
  unsigned char AND_OR      : 1;
} __BITS_SMD0_PRM_S10;
#endif
__IO_REG8_BIT(SMD0_PRM_S10, 0x5512, __READ_WRITE, __BITS_SMD0_PRM_S10);

/* Parameter 1 S1 register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 2;
  unsigned char CEDGE0      : 1;
  unsigned char CEDGE1      : 1;
  unsigned char CNT_RSTC    : 1;
  unsigned char PULS_CMP    : 1;
  unsigned char HOLD_EXIT   : 1;
} __BITS_SMD0_PRM_S11;
#endif
__IO_REG8_BIT(SMD0_PRM_S11, 0x5513, __READ_WRITE, __BITS_SMD0_PRM_S11);

/* Parameter 2 S1 register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LATCH_RS    : 1;
} __BITS_SMD0_PRM_S12;
#endif
__IO_REG8_BIT(SMD0_PRM_S12, 0x5514, __READ_WRITE, __BITS_SMD0_PRM_S12);

/* Parameter 0 S2 register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char NX_STAT0    : 1;
  unsigned char NX_STAT1    : 1;
  unsigned char EDGE0       : 1;
  unsigned char EDGE1       : 1;
  unsigned char CNT_RSTE    : 1;
  unsigned char PULS_EDG    : 1;
  unsigned char HOLD_JMP    : 1;
  unsigned char AND_OR      : 1;
} __BITS_SMD0_PRM_S20;
#endif
__IO_REG8_BIT(SMD0_PRM_S20, 0x5515, __READ_WRITE, __BITS_SMD0_PRM_S20);

/* Parameter 1 S2 register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 2;
  unsigned char CEDGE0      : 1;
  unsigned char CEDGE1      : 1;
  unsigned char CNT_RSTC    : 1;
  unsigned char PULS_CMP    : 1;
  unsigned char HOLD_EXIT   : 1;
} __BITS_SMD0_PRM_S21;
#endif
__IO_REG8_BIT(SMD0_PRM_S21, 0x5516, __READ_WRITE, __BITS_SMD0_PRM_S21);

/* Parameter 2 S2 register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LATCH_RS    : 1;
} __BITS_SMD0_PRM_S22;
#endif
__IO_REG8_BIT(SMD0_PRM_S22, 0x5517, __READ_WRITE, __BITS_SMD0_PRM_S22);

/* Parameter 0 S3 register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char NX_STAT0    : 1;
  unsigned char NX_STAT1    : 1;
  unsigned char EDGE0       : 1;
  unsigned char EDGE1       : 1;
  unsigned char CNT_RSTE    : 1;
  unsigned char PULS_EDG    : 1;
  unsigned char HOLD_JMP    : 1;
  unsigned char AND_OR      : 1;
} __BITS_SMD0_PRM_S30;
#endif
__IO_REG8_BIT(SMD0_PRM_S30, 0x5518, __READ_WRITE, __BITS_SMD0_PRM_S30);

/* Parameter 1 S3 register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 2;
  unsigned char CEDGE0      : 1;
  unsigned char CEDGE1      : 1;
  unsigned char CNT_RSTC    : 1;
  unsigned char PULS_CMP    : 1;
  unsigned char HOLD_EXIT   : 1;
} __BITS_SMD0_PRM_S31;
#endif
__IO_REG8_BIT(SMD0_PRM_S31, 0x5519, __READ_WRITE, __BITS_SMD0_PRM_S31);

/* Parameter 2 S3 register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LATCH_RS    : 1;
} __BITS_SMD0_PRM_S32;
#endif
__IO_REG8_BIT(SMD0_PRM_S32, 0x551A, __READ_WRITE, __BITS_SMD0_PRM_S32);

/* Timer configuration register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 1;
  unsigned char TIM_NUM0    : 1;
  unsigned char TIM_NUM1    : 1;
  unsigned char TIM_UPD0    : 1;
  unsigned char TIM_UPD1    : 1;
} __BITS_SMD0_CFG;
#endif
__IO_REG8_BIT(SMD0_CFG,    0x551B, __READ_WRITE, __BITS_SMD0_CFG);

