yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/ioastwbc5v.h
/* Parameter 2 S2 register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LATCH_RS    : 1;
} __BITS_SMD1_PRM_S22;
#endif
__IO_REG8_BIT(SMD1_PRM_S22, 0x5557, __READ_WRITE, __BITS_SMD1_PRM_S22);

/* Parameter 0 S3 register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char NX_STAT0    : 1;
  unsigned char NX_STAT1    : 1;
  unsigned char EDGE0       : 1;
  unsigned char EDGE1       : 1;
  unsigned char CNT_RSTE    : 1;
  unsigned char PULS_EDG    : 1;
  unsigned char HOLD_JMP    : 1;
  unsigned char AND_OR      : 1;
} __BITS_SMD1_PRM_S30;
#endif
__IO_REG8_BIT(SMD1_PRM_S30, 0x5558, __READ_WRITE, __BITS_SMD1_PRM_S30);

/* Parameter 1 S3 register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 2;
  unsigned char CEDGE0      : 1;
  unsigned char CEDGE1      : 1;
  unsigned char CNT_RSTC    : 1;
  unsigned char PULS_CMP    : 1;
  unsigned char HOLD_EXIT   : 1;
} __BITS_SMD1_PRM_S31;
#endif
__IO_REG8_BIT(SMD1_PRM_S31, 0x5559, __READ_WRITE, __BITS_SMD1_PRM_S31);

/* Parameter 2 S3 register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LATCH_RS    : 1;
} __BITS_SMD1_PRM_S32;
#endif
__IO_REG8_BIT(SMD1_PRM_S32, 0x555A, __READ_WRITE, __BITS_SMD1_PRM_S32);

/* Timer configuration register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 1;
  unsigned char TIM_NUM0    : 1;
  unsigned char TIM_NUM1    : 1;
  unsigned char TIM_UPD0    : 1;
  unsigned char TIM_UPD1    : 1;
} __BITS_SMD1_CFG;
#endif
__IO_REG8_BIT(SMD1_CFG,    0x555B, __READ_WRITE, __BITS_SMD1_CFG);

/* Dump counter lsb register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CNT_LO0     : 1;
  unsigned char CNT_LO1     : 1;
  unsigned char CNT_LO2     : 1;
  unsigned char CNT_LO3     : 1;
  unsigned char CNT_LO4     : 1;
  unsigned char CNT_LO5     : 1;
  unsigned char CNT_LO6     : 1;
  unsigned char CNT_LO7     : 1;
} __BITS_SMD1_DMP_L;
#endif
__IO_REG8_BIT(SMD1_DMP_L,  0x555C, __READ, __BITS_SMD1_DMP_L);

/* Dump counter msb register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CNT_LH0     : 1;
  unsigned char CNT_LH1     : 1;
  unsigned char CNT_LH2     : 1;
  unsigned char CNT_LH3     : 1;
  unsigned char CNT_LH4     : 1;
  unsigned char CNT_LH5     : 1;
  unsigned char CNT_LH6     : 1;
  unsigned char CNT_LH7     : 1;
} __BITS_SMD1_DMP_H;
#endif
__IO_REG8_BIT(SMD1_DMP_H,  0x555D, __READ, __BITS_SMD1_DMP_H);

/* General status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char EX0_DUMP    : 1;
  unsigned char EX1_DUMP    : 1;
  unsigned char EX2_DUMP    : 1;
  unsigned char CNT_FLAG    : 1;
  unsigned char DMP_LK0     : 1;
  unsigned char DMP_LK1     : 1;
  unsigned char EVENT_OV    : 1;
} __BITS_SMD1_GSTS;
#endif
__IO_REG8_BIT(SMD1_GSTS,   0x555E, __READ_WRITE, __BITS_SMD1_GSTS);

/* Interrupt status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CNT_OVER    : 1;
  unsigned char EXT0_INT    : 1;
  unsigned char EXT1_INT    : 1;
  unsigned char EXT2_INT    : 1;
  unsigned char STA_S0_IT   : 1;
  unsigned char STA_S1_IT   : 1;
  unsigned char STA_S2_IT   : 1;
  unsigned char STA_S3_IT   : 1;
} __BITS_SMD1_ISR;
#endif
__IO_REG8_BIT(SMD1_ISR,    0x555F, __READ_WRITE, __BITS_SMD1_ISR);

/* Interrupt mask register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CNT_OV_R    : 1;
  unsigned char IT_EXT0     : 1;
  unsigned char IT_EXT1     : 1;
  unsigned char IT_EXT2     : 1;
  unsigned char IT_STA_S0   : 1;
  unsigned char IT_STA_S1   : 1;
  unsigned char IT_STA_S2   : 1;
  unsigned char IT_STA_S3   : 1;
} __BITS_SMD1_IMR;
#endif
__IO_REG8_BIT(SMD1_IMR,    0x5560, __READ_WRITE, __BITS_SMD1_IMR);

/* External event control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char INPUT0_EN   : 1;
  unsigned char INPUT1_EN   : 1;
  unsigned char INPUT2_EN   : 1;
  unsigned char INPUT_LAT   : 1;
} __BITS_SMD1_ISEL;
#endif
__IO_REG8_BIT(SMD1_ISEL,   0x5561, __READ_WRITE, __BITS_SMD1_ISEL);

/* Dump enable register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DMPE_EX0    : 1;
  unsigned char DMPE_EX1    : 1;
  unsigned char DMPE_EX2    : 1;
  unsigned char DMP_EVER    : 1;
  unsigned char CPL_IT_GE   : 1;
} __BITS_SMD1_DMP;
#endif
__IO_REG8_BIT(SMD1_DMP,    0x5562, __READ_WRITE, __BITS_SMD1_DMP);

/* FSM status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char FSM0        : 1;
  unsigned char FSM1        : 1;
  unsigned char FSM2        : 1;
  unsigned char PWM         : 1;
  unsigned char EVINP0      : 1;
  unsigned char EVINP1      : 1;
  unsigned char EVINP2      : 1;
} __BITS_SMD1_FSM_STS;
#endif
__IO_REG8_BIT(SMD1_FSM_STS, 0x5563, __READ, __BITS_SMD1_FSM_STS);


/*-------------------------------------------------------------------------
 *      SMED 1 Registers bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define SMD1_CTR_START_CNT       SMD1_CTR_bit.START_CNT
#define SMD1_CTR_FSM_ENA         SMD1_CTR_bit.FSM_ENA

#define SMD1_CTR_TMR_TIME_T0_VAL SMD1_CTR_TMR_bit.TIME_T0_VAL
#define SMD1_CTR_TMR_TIME_T1_VAL SMD1_CTR_TMR_bit.TIME_T1_VAL
#define SMD1_CTR_TMR_TIME_T2_VAL SMD1_CTR_TMR_bit.TIME_T2_VAL
#define SMD1_CTR_TMR_TIME_T3_VAL SMD1_CTR_TMR_bit.TIME_T3_VAL
#define SMD1_CTR_TMR_DITHER_VAL  SMD1_CTR_TMR_bit.DITHER_VAL

#define SMD1_CTR_INP_RS_INSIG0   SMD1_CTR_INP_bit.RS_INSIG0
#define SMD1_CTR_INP_RS_INSIG1   SMD1_CTR_INP_bit.RS_INSIG1
#define SMD1_CTR_INP_RS_INSIG2   SMD1_CTR_INP_bit.RS_INSIG2
#define SMD1_CTR_INP_RAIS_EN     SMD1_CTR_INP_bit.RAIS_EN
#define SMD1_CTR_INP_EL_INSIG0   SMD1_CTR_INP_bit.EL_INSIG0
#define SMD1_CTR_INP_EL_INSIG1   SMD1_CTR_INP_bit.EL_INSIG1
#define SMD1_CTR_INP_EL_INSIG2   SMD1_CTR_INP_bit.EL_INSIG2
#define SMD1_CTR_INP_EL_EN       SMD1_CTR_INP_bit.EL_EN

#define SMD1_CTR_DTHR_DITH0      SMD1_CTR_DTHR_bit.DITH0
#define SMD1_CTR_DTHR_DITH1      SMD1_CTR_DTHR_bit.DITH1
#define SMD1_CTR_DTHR_DITH2      SMD1_CTR_DTHR_bit.DITH2
#define SMD1_CTR_DTHR_DITH3      SMD1_CTR_DTHR_bit.DITH3
#define SMD1_CTR_DTHR_DITH4      SMD1_CTR_DTHR_bit.DITH4
#define SMD1_CTR_DTHR_DITH5      SMD1_CTR_DTHR_bit.DITH5
#define SMD1_CTR_DTHR_DITH6      SMD1_CTR_DTHR_bit.DITH6
#define SMD1_CTR_DTHR_DITH7      SMD1_CTR_DTHR_bit.DITH7

