yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/ioastwbc5v.h
#define MASK_SMD4_TMR_T2L_TIM_T2L0 0x01
#define MASK_SMD4_TMR_T2L_TIM_T2L1 0x02
#define MASK_SMD4_TMR_T2L_TIM_T2L2 0x04
#define MASK_SMD4_TMR_T2L_TIM_T2L3 0x08
#define MASK_SMD4_TMR_T2L_TIM_T2L4 0x10
#define MASK_SMD4_TMR_T2L_TIM_T2L5 0x20
#define MASK_SMD4_TMR_T2L_TIM_T2L6 0x40
#define MASK_SMD4_TMR_T2L_TIM_T2L7 0x80

#define MASK_SMD4_TMR_T2H_TIM_T2H0 0x01
#define MASK_SMD4_TMR_T2H_TIM_T2H1 0x02
#define MASK_SMD4_TMR_T2H_TIM_T2H2 0x04
#define MASK_SMD4_TMR_T2H_TIM_T2H3 0x08
#define MASK_SMD4_TMR_T2H_TIM_T2H4 0x10
#define MASK_SMD4_TMR_T2H_TIM_T2H5 0x20
#define MASK_SMD4_TMR_T2H_TIM_T2H6 0x40
#define MASK_SMD4_TMR_T2H_TIM_T2H7 0x80

#define MASK_SMD4_TMR_T3L_TIM_T3L0 0x01
#define MASK_SMD4_TMR_T3L_TIM_T3L1 0x02
#define MASK_SMD4_TMR_T3L_TIM_T3L2 0x04
#define MASK_SMD4_TMR_T3L_TIM_T3L3 0x08
#define MASK_SMD4_TMR_T3L_TIM_T3L4 0x10
#define MASK_SMD4_TMR_T3L_TIM_T3L5 0x20
#define MASK_SMD4_TMR_T3L_TIM_T3L6 0x40
#define MASK_SMD4_TMR_T3L_TIM_T3L7 0x80

#define MASK_SMD4_TMR_T3H_TIM_T3H0 0x01
#define MASK_SMD4_TMR_T3H_TIM_T3H1 0x02
#define MASK_SMD4_TMR_T3H_TIM_T3H2 0x04
#define MASK_SMD4_TMR_T3H_TIM_T3H3 0x08
#define MASK_SMD4_TMR_T3H_TIM_T3H4 0x10
#define MASK_SMD4_TMR_T3H_TIM_T3H5 0x20
#define MASK_SMD4_TMR_T3H_TIM_T3H6 0x40
#define MASK_SMD4_TMR_T3H_TIM_T3H7 0x80

#define MASK_SMD4_PRM_ID0_NX_STAT0 0x01
#define MASK_SMD4_PRM_ID0_NX_STAT1 0x02
#define MASK_SMD4_PRM_ID0_EDGE0  0x04
#define MASK_SMD4_PRM_ID0_EDGE1  0x08
#define MASK_SMD4_PRM_ID0_CNT_RSTE 0x10
#define MASK_SMD4_PRM_ID0_PULS_EDG 0x20
#define MASK_SMD4_PRM_ID0_HOLD_JMP 0x40
#define MASK_SMD4_PRM_ID0_AND_OR 0x80

#define MASK_SMD4_PRM_ID1_CEDGE0 0x04
#define MASK_SMD4_PRM_ID1_CEDGE1 0x08
#define MASK_SMD4_PRM_ID1_CNT_RSTC 0x10
#define MASK_SMD4_PRM_ID1_PULS_CMP 0x20
#define MASK_SMD4_PRM_ID1_HOLD_EXIT 0x40

#define MASK_SMD4_PRM_ID2_LATCH_RS 0x01

#define MASK_SMD4_PRM_S00_NX_STAT0 0x01
#define MASK_SMD4_PRM_S00_NX_STAT1 0x02
#define MASK_SMD4_PRM_S00_EDGE0  0x04
#define MASK_SMD4_PRM_S00_EDGE1  0x08
#define MASK_SMD4_PRM_S00_CNT_RSTE 0x10
#define MASK_SMD4_PRM_S00_PULS_EDG 0x20
#define MASK_SMD4_PRM_S00_HOLD_JMP 0x40
#define MASK_SMD4_PRM_S00_AND_OR 0x80

#define MASK_SMD4_PRM_S01_CEDGE0 0x04
#define MASK_SMD4_PRM_S01_CEDGE1 0x08
#define MASK_SMD4_PRM_S01_CNT_RSTC 0x10
#define MASK_SMD4_PRM_S01_PULS_CMP 0x20
#define MASK_SMD4_PRM_S01_HOLD_EXIT 0x40

#define MASK_SMD4_PRM_S02_LATCH_RS 0x01

#define MASK_SMD4_PRM_S10_NX_STAT0 0x01
#define MASK_SMD4_PRM_S10_NX_STAT1 0x02
#define MASK_SMD4_PRM_S10_EDGE0  0x04
#define MASK_SMD4_PRM_S10_EDGE1  0x08
#define MASK_SMD4_PRM_S10_CNT_RSTE 0x10
#define MASK_SMD4_PRM_S10_PULS_EDG 0x20
#define MASK_SMD4_PRM_S10_HOLD_JMP 0x40
#define MASK_SMD4_PRM_S10_AND_OR 0x80

#define MASK_SMD4_PRM_S11_CEDGE0 0x04
#define MASK_SMD4_PRM_S11_CEDGE1 0x08
#define MASK_SMD4_PRM_S11_CNT_RSTC 0x10
#define MASK_SMD4_PRM_S11_PULS_CMP 0x20
#define MASK_SMD4_PRM_S11_HOLD_EXIT 0x40

#define MASK_SMD4_PRM_S12_LATCH_RS 0x01

#define MASK_SMD4_PRM_S20_NX_STAT0 0x01
#define MASK_SMD4_PRM_S20_NX_STAT1 0x02
#define MASK_SMD4_PRM_S20_EDGE0  0x04
#define MASK_SMD4_PRM_S20_EDGE1  0x08
#define MASK_SMD4_PRM_S20_CNT_RSTE 0x10
#define MASK_SMD4_PRM_S20_PULS_EDG 0x20
#define MASK_SMD4_PRM_S20_HOLD_JMP 0x40
#define MASK_SMD4_PRM_S20_AND_OR 0x80

#define MASK_SMD4_PRM_S21_CEDGE0 0x04
#define MASK_SMD4_PRM_S21_CEDGE1 0x08
#define MASK_SMD4_PRM_S21_CNT_RSTC 0x10
#define MASK_SMD4_PRM_S21_PULS_CMP 0x20
#define MASK_SMD4_PRM_S21_HOLD_EXIT 0x40

#define MASK_SMD4_PRM_S22_LATCH_RS 0x01

#define MASK_SMD4_PRM_S30_NX_STAT0 0x01
#define MASK_SMD4_PRM_S30_NX_STAT1 0x02
#define MASK_SMD4_PRM_S30_EDGE0  0x04
#define MASK_SMD4_PRM_S30_EDGE1  0x08
#define MASK_SMD4_PRM_S30_CNT_RSTE 0x10
#define MASK_SMD4_PRM_S30_PULS_EDG 0x20
#define MASK_SMD4_PRM_S30_HOLD_JMP 0x40
#define MASK_SMD4_PRM_S30_AND_OR 0x80

#define MASK_SMD4_PRM_S31_CEDGE0 0x04
#define MASK_SMD4_PRM_S31_CEDGE1 0x08
#define MASK_SMD4_PRM_S31_CNT_RSTC 0x10
#define MASK_SMD4_PRM_S31_PULS_CMP 0x20
#define MASK_SMD4_PRM_S31_HOLD_EXIT 0x40

#define MASK_SMD4_PRM_S32_LATCH_RS 0x01

#define MASK_SMD4_CFG_TIM_NUM0   0x02
#define MASK_SMD4_CFG_TIM_NUM1   0x04
#define MASK_SMD4_CFG_TIM_UPD0   0x08
#define MASK_SMD4_CFG_TIM_UPD1   0x10

#define MASK_SMD4_DMP_L_CNT_LO0  0x01
#define MASK_SMD4_DMP_L_CNT_LO1  0x02
#define MASK_SMD4_DMP_L_CNT_LO2  0x04
#define MASK_SMD4_DMP_L_CNT_LO3  0x08
#define MASK_SMD4_DMP_L_CNT_LO4  0x10
#define MASK_SMD4_DMP_L_CNT_LO5  0x20
#define MASK_SMD4_DMP_L_CNT_LO6  0x40
#define MASK_SMD4_DMP_L_CNT_LO7  0x80

#define MASK_SMD4_DMP_H_CNT_LH0  0x01
#define MASK_SMD4_DMP_H_CNT_LH1  0x02
#define MASK_SMD4_DMP_H_CNT_LH2  0x04
#define MASK_SMD4_DMP_H_CNT_LH3  0x08
#define MASK_SMD4_DMP_H_CNT_LH4  0x10
#define MASK_SMD4_DMP_H_CNT_LH5  0x20
#define MASK_SMD4_DMP_H_CNT_LH6  0x40
#define MASK_SMD4_DMP_H_CNT_LH7  0x80

#define MASK_SMD4_GSTS_EX0_DUMP  0x01
#define MASK_SMD4_GSTS_EX1_DUMP  0x02
#define MASK_SMD4_GSTS_EX2_DUMP  0x04
#define MASK_SMD4_GSTS_CNT_FLAG  0x08
#define MASK_SMD4_GSTS_DMP_LK0   0x10
#define MASK_SMD4_GSTS_DMP_LK1   0x20
#define MASK_SMD4_GSTS_EVENT_OV  0x40

#define MASK_SMD4_ISR_CNT_OVER   0x01
#define MASK_SMD4_ISR_EXT0_INT   0x02
#define MASK_SMD4_ISR_EXT1_INT   0x04
#define MASK_SMD4_ISR_EXT2_INT   0x08
#define MASK_SMD4_ISR_STA_S0_IT  0x10
#define MASK_SMD4_ISR_STA_S1_IT  0x20
#define MASK_SMD4_ISR_STA_S2_IT  0x40
#define MASK_SMD4_ISR_STA_S3_IT  0x80

#define MASK_SMD4_IMR_CNT_OV_R   0x01
#define MASK_SMD4_IMR_IT_EXT0    0x02
#define MASK_SMD4_IMR_IT_EXT1    0x04
#define MASK_SMD4_IMR_IT_EXT2    0x08
#define MASK_SMD4_IMR_IT_STA_S0  0x10
#define MASK_SMD4_IMR_IT_STA_S1  0x20
#define MASK_SMD4_IMR_IT_STA_S2  0x40
#define MASK_SMD4_IMR_IT_STA_S3  0x80

#define MASK_SMD4_ISEL_INPUT0_EN 0x01
#define MASK_SMD4_ISEL_INPUT1_EN 0x02
#define MASK_SMD4_ISEL_INPUT2_EN 0x04
#define MASK_SMD4_ISEL_INPUT_LAT 0x08

#define MASK_SMD4_DMP_DMPE_EX0   0x01
#define MASK_SMD4_DMP_DMPE_EX1   0x02
#define MASK_SMD4_DMP_DMPE_EX2   0x04
#define MASK_SMD4_DMP_DMP_EVER   0x08
#define MASK_SMD4_DMP_CPL_IT_GE  0x10

#define MASK_SMD4_FSM_STS_FSM0   0x01
#define MASK_SMD4_FSM_STS_FSM1   0x02
#define MASK_SMD4_FSM_STS_FSM2   0x04
#define MASK_SMD4_FSM_STS_PWM    0x08
#define MASK_SMD4_FSM_STS_EVINP0 0x10
#define MASK_SMD4_FSM_STS_EVINP1 0x20
#define MASK_SMD4_FSM_STS_EVINP2 0x40


/*-------------------------------------------------------------------------
 *      SMED 5 Registers register definitions
 *-----------------------------------------------------------------------*/
/* Control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char START_CNT   : 1;
  unsigned char FSM_ENA     : 1;
} __BITS_SMD5_CTR;
#endif
__IO_REG8_BIT(SMD5_CTR,    0x5640, __READ_WRITE, __BITS_SMD5_CTR);

/* Control timer register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TIME_T0_VAL : 1;
  unsigned char TIME_T1_VAL : 1;
  unsigned char TIME_T2_VAL : 1;
  unsigned char TIME_T3_VAL : 1;
  unsigned char DITHER_VAL  : 1;
} __BITS_SMD5_CTR_TMR;
#endif
__IO_REG8_BIT(SMD5_CTR_TMR, 0x5641, __READ_WRITE, __BITS_SMD5_CTR_TMR);

/* Control input register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RS_INSIG0   : 1;
  unsigned char RS_INSIG1   : 1;
  unsigned char RS_INSIG2   : 1;
  unsigned char RAIS_EN     : 1;
  unsigned char EL_INSIG0   : 1;
  unsigned char EL_INSIG1   : 1;
  unsigned char EL_INSIG2   : 1;
  unsigned char EL_EN       : 1;
} __BITS_SMD5_CTR_INP;
#endif
__IO_REG8_BIT(SMD5_CTR_INP, 0x5642, __READ_WRITE, __BITS_SMD5_CTR_INP);

/* Dithering register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DITH0       : 1;
  unsigned char DITH1       : 1;
  unsigned char DITH2       : 1;
  unsigned char DITH3       : 1;
  unsigned char DITH4       : 1;
  unsigned char DITH5       : 1;
  unsigned char DITH6       : 1;
  unsigned char DITH7       : 1;
} __BITS_SMD5_CTR_DTHR;
#endif
__IO_REG8_BIT(SMD5_CTR_DTHR, 0x5643, __READ_WRITE, __BITS_SMD5_CTR_DTHR);

/* Time T0 lsb register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TIM_T0L0    : 1;
  unsigned char TIM_T0L1    : 1;
  unsigned char TIM_T0L2    : 1;
  unsigned char TIM_T0L3    : 1;
  unsigned char TIM_T0L4    : 1;
  unsigned char TIM_T0L5    : 1;
  unsigned char TIM_T0L6    : 1;
  unsigned char TIM_T0L7    : 1;
} __BITS_SMD5_TMR_T0L;
#endif
__IO_REG8_BIT(SMD5_TMR_T0L, 0x5644, __READ_WRITE, __BITS_SMD5_TMR_T0L);

/* Time T0 msb register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TIM_T0H0    : 1;
  unsigned char TIM_T0H1    : 1;
  unsigned char TIM_T0H2    : 1;
  unsigned char TIM_T0H3    : 1;
  unsigned char TIM_T0H4    : 1;
  unsigned char TIM_T0H5    : 1;
  unsigned char TIM_T0H6    : 1;
  unsigned char TIM_T0H7    : 1;
} __BITS_SMD5_TMR_T0H;
#endif
__IO_REG8_BIT(SMD5_TMR_T0H, 0x5645, __READ_WRITE, __BITS_SMD5_TMR_T0H);

