yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/ioastwbc5v.h
#define SMD5_TMR_T2L_TIM_T2L0    SMD5_TMR_T2L_bit.TIM_T2L0
#define SMD5_TMR_T2L_TIM_T2L1    SMD5_TMR_T2L_bit.TIM_T2L1
#define SMD5_TMR_T2L_TIM_T2L2    SMD5_TMR_T2L_bit.TIM_T2L2
#define SMD5_TMR_T2L_TIM_T2L3    SMD5_TMR_T2L_bit.TIM_T2L3
#define SMD5_TMR_T2L_TIM_T2L4    SMD5_TMR_T2L_bit.TIM_T2L4
#define SMD5_TMR_T2L_TIM_T2L5    SMD5_TMR_T2L_bit.TIM_T2L5
#define SMD5_TMR_T2L_TIM_T2L6    SMD5_TMR_T2L_bit.TIM_T2L6
#define SMD5_TMR_T2L_TIM_T2L7    SMD5_TMR_T2L_bit.TIM_T2L7

#define SMD5_TMR_T2H_TIM_T2H0    SMD5_TMR_T2H_bit.TIM_T2H0
#define SMD5_TMR_T2H_TIM_T2H1    SMD5_TMR_T2H_bit.TIM_T2H1
#define SMD5_TMR_T2H_TIM_T2H2    SMD5_TMR_T2H_bit.TIM_T2H2
#define SMD5_TMR_T2H_TIM_T2H3    SMD5_TMR_T2H_bit.TIM_T2H3
#define SMD5_TMR_T2H_TIM_T2H4    SMD5_TMR_T2H_bit.TIM_T2H4
#define SMD5_TMR_T2H_TIM_T2H5    SMD5_TMR_T2H_bit.TIM_T2H5
#define SMD5_TMR_T2H_TIM_T2H6    SMD5_TMR_T2H_bit.TIM_T2H6
#define SMD5_TMR_T2H_TIM_T2H7    SMD5_TMR_T2H_bit.TIM_T2H7

#define SMD5_TMR_T3L_TIM_T3L0    SMD5_TMR_T3L_bit.TIM_T3L0
#define SMD5_TMR_T3L_TIM_T3L1    SMD5_TMR_T3L_bit.TIM_T3L1
#define SMD5_TMR_T3L_TIM_T3L2    SMD5_TMR_T3L_bit.TIM_T3L2
#define SMD5_TMR_T3L_TIM_T3L3    SMD5_TMR_T3L_bit.TIM_T3L3
#define SMD5_TMR_T3L_TIM_T3L4    SMD5_TMR_T3L_bit.TIM_T3L4
#define SMD5_TMR_T3L_TIM_T3L5    SMD5_TMR_T3L_bit.TIM_T3L5
#define SMD5_TMR_T3L_TIM_T3L6    SMD5_TMR_T3L_bit.TIM_T3L6
#define SMD5_TMR_T3L_TIM_T3L7    SMD5_TMR_T3L_bit.TIM_T3L7

#define SMD5_TMR_T3H_TIM_T3H0    SMD5_TMR_T3H_bit.TIM_T3H0
#define SMD5_TMR_T3H_TIM_T3H1    SMD5_TMR_T3H_bit.TIM_T3H1
#define SMD5_TMR_T3H_TIM_T3H2    SMD5_TMR_T3H_bit.TIM_T3H2
#define SMD5_TMR_T3H_TIM_T3H3    SMD5_TMR_T3H_bit.TIM_T3H3
#define SMD5_TMR_T3H_TIM_T3H4    SMD5_TMR_T3H_bit.TIM_T3H4
#define SMD5_TMR_T3H_TIM_T3H5    SMD5_TMR_T3H_bit.TIM_T3H5
#define SMD5_TMR_T3H_TIM_T3H6    SMD5_TMR_T3H_bit.TIM_T3H6
#define SMD5_TMR_T3H_TIM_T3H7    SMD5_TMR_T3H_bit.TIM_T3H7

#define SMD5_PRM_ID0_NX_STAT0    SMD5_PRM_ID0_bit.NX_STAT0
#define SMD5_PRM_ID0_NX_STAT1    SMD5_PRM_ID0_bit.NX_STAT1
#define SMD5_PRM_ID0_EDGE0       SMD5_PRM_ID0_bit.EDGE0
#define SMD5_PRM_ID0_EDGE1       SMD5_PRM_ID0_bit.EDGE1
#define SMD5_PRM_ID0_CNT_RSTE    SMD5_PRM_ID0_bit.CNT_RSTE
#define SMD5_PRM_ID0_PULS_EDG    SMD5_PRM_ID0_bit.PULS_EDG
#define SMD5_PRM_ID0_HOLD_JMP    SMD5_PRM_ID0_bit.HOLD_JMP
#define SMD5_PRM_ID0_AND_OR      SMD5_PRM_ID0_bit.AND_OR

#define SMD5_PRM_ID1_CEDGE0      SMD5_PRM_ID1_bit.CEDGE0
#define SMD5_PRM_ID1_CEDGE1      SMD5_PRM_ID1_bit.CEDGE1
#define SMD5_PRM_ID1_CNT_RSTC    SMD5_PRM_ID1_bit.CNT_RSTC
#define SMD5_PRM_ID1_PULS_CMP    SMD5_PRM_ID1_bit.PULS_CMP
#define SMD5_PRM_ID1_HOLD_EXIT   SMD5_PRM_ID1_bit.HOLD_EXIT

#define SMD5_PRM_ID2_LATCH_RS    SMD5_PRM_ID2_bit.LATCH_RS

#define SMD5_PRM_S00_NX_STAT0    SMD5_PRM_S00_bit.NX_STAT0
#define SMD5_PRM_S00_NX_STAT1    SMD5_PRM_S00_bit.NX_STAT1
#define SMD5_PRM_S00_EDGE0       SMD5_PRM_S00_bit.EDGE0
#define SMD5_PRM_S00_EDGE1       SMD5_PRM_S00_bit.EDGE1
#define SMD5_PRM_S00_CNT_RSTE    SMD5_PRM_S00_bit.CNT_RSTE
#define SMD5_PRM_S00_PULS_EDG    SMD5_PRM_S00_bit.PULS_EDG
#define SMD5_PRM_S00_HOLD_JMP    SMD5_PRM_S00_bit.HOLD_JMP
#define SMD5_PRM_S00_AND_OR      SMD5_PRM_S00_bit.AND_OR

#define SMD5_PRM_S01_CEDGE0      SMD5_PRM_S01_bit.CEDGE0
#define SMD5_PRM_S01_CEDGE1      SMD5_PRM_S01_bit.CEDGE1
#define SMD5_PRM_S01_CNT_RSTC    SMD5_PRM_S01_bit.CNT_RSTC
#define SMD5_PRM_S01_PULS_CMP    SMD5_PRM_S01_bit.PULS_CMP
#define SMD5_PRM_S01_HOLD_EXIT   SMD5_PRM_S01_bit.HOLD_EXIT

#define SMD5_PRM_S02_LATCH_RS    SMD5_PRM_S02_bit.LATCH_RS

#define SMD5_PRM_S10_NX_STAT0    SMD5_PRM_S10_bit.NX_STAT0
#define SMD5_PRM_S10_NX_STAT1    SMD5_PRM_S10_bit.NX_STAT1
#define SMD5_PRM_S10_EDGE0       SMD5_PRM_S10_bit.EDGE0
#define SMD5_PRM_S10_EDGE1       SMD5_PRM_S10_bit.EDGE1
#define SMD5_PRM_S10_CNT_RSTE    SMD5_PRM_S10_bit.CNT_RSTE
#define SMD5_PRM_S10_PULS_EDG    SMD5_PRM_S10_bit.PULS_EDG
#define SMD5_PRM_S10_HOLD_JMP    SMD5_PRM_S10_bit.HOLD_JMP
#define SMD5_PRM_S10_AND_OR      SMD5_PRM_S10_bit.AND_OR

#define SMD5_PRM_S11_CEDGE0      SMD5_PRM_S11_bit.CEDGE0
#define SMD5_PRM_S11_CEDGE1      SMD5_PRM_S11_bit.CEDGE1
#define SMD5_PRM_S11_CNT_RSTC    SMD5_PRM_S11_bit.CNT_RSTC
#define SMD5_PRM_S11_PULS_CMP    SMD5_PRM_S11_bit.PULS_CMP
#define SMD5_PRM_S11_HOLD_EXIT   SMD5_PRM_S11_bit.HOLD_EXIT

#define SMD5_PRM_S12_LATCH_RS    SMD5_PRM_S12_bit.LATCH_RS

#define SMD5_PRM_S20_NX_STAT0    SMD5_PRM_S20_bit.NX_STAT0
#define SMD5_PRM_S20_NX_STAT1    SMD5_PRM_S20_bit.NX_STAT1
#define SMD5_PRM_S20_EDGE0       SMD5_PRM_S20_bit.EDGE0
#define SMD5_PRM_S20_EDGE1       SMD5_PRM_S20_bit.EDGE1
#define SMD5_PRM_S20_CNT_RSTE    SMD5_PRM_S20_bit.CNT_RSTE
#define SMD5_PRM_S20_PULS_EDG    SMD5_PRM_S20_bit.PULS_EDG
#define SMD5_PRM_S20_HOLD_JMP    SMD5_PRM_S20_bit.HOLD_JMP
#define SMD5_PRM_S20_AND_OR      SMD5_PRM_S20_bit.AND_OR

#define SMD5_PRM_S21_CEDGE0      SMD5_PRM_S21_bit.CEDGE0
#define SMD5_PRM_S21_CEDGE1      SMD5_PRM_S21_bit.CEDGE1
#define SMD5_PRM_S21_CNT_RSTC    SMD5_PRM_S21_bit.CNT_RSTC
#define SMD5_PRM_S21_PULS_CMP    SMD5_PRM_S21_bit.PULS_CMP
#define SMD5_PRM_S21_HOLD_EXIT   SMD5_PRM_S21_bit.HOLD_EXIT

#define SMD5_PRM_S22_LATCH_RS    SMD5_PRM_S22_bit.LATCH_RS

#define SMD5_PRM_S30_NX_STAT0    SMD5_PRM_S30_bit.NX_STAT0
#define SMD5_PRM_S30_NX_STAT1    SMD5_PRM_S30_bit.NX_STAT1
#define SMD5_PRM_S30_EDGE0       SMD5_PRM_S30_bit.EDGE0
#define SMD5_PRM_S30_EDGE1       SMD5_PRM_S30_bit.EDGE1
#define SMD5_PRM_S30_CNT_RSTE    SMD5_PRM_S30_bit.CNT_RSTE
#define SMD5_PRM_S30_PULS_EDG    SMD5_PRM_S30_bit.PULS_EDG
#define SMD5_PRM_S30_HOLD_JMP    SMD5_PRM_S30_bit.HOLD_JMP
#define SMD5_PRM_S30_AND_OR      SMD5_PRM_S30_bit.AND_OR

#define SMD5_PRM_S31_CEDGE0      SMD5_PRM_S31_bit.CEDGE0
#define SMD5_PRM_S31_CEDGE1      SMD5_PRM_S31_bit.CEDGE1
#define SMD5_PRM_S31_CNT_RSTC    SMD5_PRM_S31_bit.CNT_RSTC
#define SMD5_PRM_S31_PULS_CMP    SMD5_PRM_S31_bit.PULS_CMP
#define SMD5_PRM_S31_HOLD_EXIT   SMD5_PRM_S31_bit.HOLD_EXIT

#define SMD5_PRM_S32_LATCH_RS    SMD5_PRM_S32_bit.LATCH_RS

#define SMD5_CFG_TIM_NUM0        SMD5_CFG_bit.TIM_NUM0
#define SMD5_CFG_TIM_NUM1        SMD5_CFG_bit.TIM_NUM1
#define SMD5_CFG_TIM_UPD0        SMD5_CFG_bit.TIM_UPD0
#define SMD5_CFG_TIM_UPD1        SMD5_CFG_bit.TIM_UPD1

